# Hierarchical Indexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series , DataFrame

In [11]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'e'],
[1, 2, 3, 1, 4, 1, 2, 2, 3]])

In [12]:
data

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
d  2    0.976635
e  3    0.550410
dtype: float64

In [13]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd', 'e'], [1, 2, 3, 4]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 4], [0, 1, 2, 0, 3, 0, 1, 1, 2]])

In [14]:
data['b']

1   -1.834191
4   -0.391834
dtype: float64

In [16]:
data['a':'c']

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
dtype: float64

In [19]:
data[['b','e']]

b  1   -1.834191
   4   -0.391834
e  3    0.550410
dtype: float64

In [20]:
data.loc[:, 2]

a    2.131873
c   -1.516835
d    0.976635
dtype: float64

In [21]:
data[:, 2]

a    2.131873
c   -1.516835
d    0.976635
dtype: float64

In [22]:
data

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
d  2    0.976635
e  3    0.550410
dtype: float64

In [23]:
data.unstack()

          1         2         3         4
a -1.213765  2.131873 -2.412953       NaN
b -1.834191       NaN       NaN -0.391834
c  0.265674 -1.516835       NaN       NaN
d       NaN  0.976635       NaN       NaN
e       NaN       NaN  0.550410       NaN

In [24]:
data.unstack().stack()

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
d  2    0.976635
e  3    0.550410
dtype: float64

In [25]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [26]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [28]:
frame1 = pd.DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'utah', 'Colorado'],['Green', 'Red', 'Green']])

In [29]:
frame1

     Ohio utah Colorado
    Green  Red    Green
a 1     0    1        2
  2     3    4        5
b 1     6    7        8
  2     9   10       11

In [30]:
frame.index.names = ['key1', 'key2']

In [31]:
frame.columns.names = ['state', 'color']

In [32]:
 frame

state      Ohio utah Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [33]:
frame['Ohio']

color      Green
key1 key2
a    1         0
     2         3
b    1         6
     2         9

In [36]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
 names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [37]:
frame

state      Ohio utah Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

# Reordering and Sorting Levels

In [38]:
frame

state      Ohio utah Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [39]:
frame.swaplevel('key1', 'key2')

state      Ohio utah Colorado
color     Green  Red    Green
key2 key1
1    a        0    1        2
2    a        3    4        5
1    b        6    7        8
2    b        9   10       11

In [40]:
frame.sort_index(level=1)

state      Ohio utah Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
b    1        6    7        8
a    2        3    4        5
b    2        9   10       11

In [41]:
 frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio utah Colorado
color     Green  Red    Green
key2 key1
1    a        0    1        2
     b        6    7        8
2    a        3    4        5
     b        9   10       11

# Summary Statistics by Level

In [44]:
frame

state      Ohio utah Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [42]:
frame.sum(level='key2')

state  Ohio utah Colorado
color Green  Red    Green
key2
1         6    8       10
2        12   14       16

In [43]:
frame.sum(level='key1')

state  Ohio utah Colorado
color Green  Red    Green
key1
a         3    5        7
b        15   17       19

In [45]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [46]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
 'c': ['one', 'one', 'one', 'two', 'two',
 'two', 'two'],
 'd': [0, 1, 2, 0, 1, 2, 3]})

In [47]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [48]:
 frame2 = frame.set_index(['c', 'd'])

In [49]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [50]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [51]:
frame.set_index(['c', 'd'], drop=True)

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [52]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# Combining and Merging Datasets

In [53]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})

In [54]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [55]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [56]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [57]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0